[
  {
    "section_number": 3,
    "text": "f\no\nN S\nR a D\nS e\nT\n= T\nA\n/\n\\\n< 5 5 a S s a 2 o s 5 & - < 2 5 i s n e e = e 8 3 v s c e O - 8 a e ) v 3 ~ ~ a e g e S a . & Y\n<\ncolder, ” turn 3to page 34.\nEs ges v\nIf you = say,\nBac2 s\ny\ni . 63 Q83S\n= -—=\nB sc sO goY\nws\n= Da\nay turn to page 36.\n\nAgain, the bugle sounds. More guards appear\nThey surround you and march you through the ~\ncentral arch, and then open ranks asa short, fat —\nman waddles toward you. He wears a blue velvet —\nrobe and a golden crown on his bald head. Be-\nhind him is a very thin man wearing a pointed cap\nand bells. Surely this must be King Rufus and his ~\ncourt jester!\nA guard steps forward. ‘‘King Rufus has ©\ndeigned to look at you.”\nYou bow. ‘‘King Rufus, I am honored to visit\nyour court.” :\n“Silence! I did not ask you to speak!” says the\nking. Turning to the jester, he says, ‘‘Stillwell,\nwhat say you of this intrusion into our royal\ncourt?” .\n“**Tis a sour sorrow, to us all and all us two,”’.\nsays Stillwell.\nThe king scowls and says nothing.\nThe guard points a long, bony finger in your\nface. “Well, what have you to say for yourseif?”’\nYou feel you should say something, but you\nwonder if it would be wiser to wait until the king\nhimself asks a question.\nIf you decide to speak, turn to page 37.\nIf you remain silent, turn to page 39. Wey",
    "choices": [
      {
        "text": "If you decide to speak",
        "destination": 37
      },
      {
        "text": "If you remain silent",
        "destination": 39
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 4,
    "text": "You decide to wait. As the knights ride out oft\nsight, you hear a deep voice behind you.\n“Are you going to stand behind that tree all 4\nday?” Aaya\nTurning, you look up into the eyes of a giant of ©\na man. He is wearing leggings and a tunic made\nfrom deerskin. He holds a bow in one hand. A\nquiver filled with arrows is strapped over one ©\nshoulder. ©\n“You don’t want King Henry’s knights to see 4\nyou, eh?”’ He laughs and adds, ‘Then you area ~\nfriend to me. Those puppets give me more trou-\nble than they are worth!” He bends down and\nlooks closely at your face. “My word, I have —\nnever seen the likes of you in these woods!””\n“Tama stranger from another place and—\nanother time,’”’ you say. “Could you tell me what —\nyear it is?”’\nThe giant laughs again. ‘I don’t keep count,”\nhe says, “and I have never seen why anyone —\nshould! Garth is my name, and you can stay with\nme, if you like.”\n“Where do you live?” you ask.\nGarth answers with a wave of his arm. “My |\nhouse is the whole wide forest! There is plenty of —\nfood, and plenty to do—it is the only place where\na person can be free. Why not join me? Of —\ncourse, if you are bothered bya little rain and |\nwind now and then, you can follow that road to é\nCotwin Castle. They'll give you a roof over your ©\nhead. | must warn you, though, it might be the_\nroof of a dungeon.”’\n\nIfy ou decide to go with Garth, turn to page 7,\nif you decide to try your luck at Cotwin Castle,\nturn to page 9.\n\nJust as the knights mount their horses, you step\nout from behind the tree.\n‘Who are you?” asks Sir Godfrey. ‘‘Where did\nyou get those strange garments?”\n“I know a spy when | see one,’ says Sir\nRupert. He leans over and pulls you roughly up\non his horse. “‘If this is not.a spy, it is the devil!’\nSir Godfrey bring his horse up next to you and\nstares at you intently. “The devil is crafty, and\nknows how to assume an innocent form, but I will\nnot be fooled! We’ll take this devil to the castle,\nRupert, and thence to the dungeon.”’\nTurn to page 10.\n\n- You’ve always wanted to learn how to live in\nthe wilderness. This seems like the perfect\n_ chance. You follow Garth as he leads you\n_ through pine forests, across roaring brooks, and\n- up steep rock ledges. The sun has dipped below\n_ the western hills when you reach a shelter under ~\n- arock ledge. You help him gather sticks and pine\n_ boughs, and you are soon warming your hands\n- before a blazing fire.\n“Why do you live in the woods like this?”’ you\nask.\nHe grins. ‘‘Ever since I told King Henry that he\n_ was no better a man than anyone else, he’s hada\n_ price on my head. He has lost five of his best\n_ knights trying to bring me to the gallows.”’\n“Before I met you, I overheard his knights\ntalking about some riddle. Do you know anything\nabout it?”’\n_ “Yes, and it is quite a story,” says Garth.\n‘About a year ago an old monk visited the king\nand told him about a mysterious castle. Of\ncourse, the king demanded to know where this\ncastle is. But the monk would not tell. Instead, he\nrecited a strange riddle and then said, ‘Who\nsolves the riddle will find the castle. And who\n- conquers the castle will rule all Europe.’\n“Ever since then, King Henry has been trying\n- to solve the riddle. He is angry because none of\nhis wise men can do so.”’\nGo on to page 8. __",
    "choices": [
      {
        "text": "”’ Ify ou decide to go with Garth",
        "destination": 7
      },
      {
        "text": "if you decide to try your luck at Cotwin Castle",
        "destination": 9
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 5,
    "text": "LW(i(jee ( r— e CG\nLG\nCG\nUCC\n(\nce\nCO\nfy\n\nv R e e 0O y RKZO e\n=\n——\n-————\nF<i 2\n—<\n~\nZZ\nOLT8 8140:\nATLF AL htI OASL LPAg i\nLbIylTadLAT pA A DL LE\nUULLLL iLfLf seas\nELLY Ka\nOWEME IL.P AIttS sg ,\nLLM\nete\n\nRe | qa\nou and Michelle follow the trail to the west,\nwhich winds around the steep hillside. The sun is\nbeginning to set when you see a rambling build-.\ning made of stones and logs. Wild flowers and\nferns are growing on the sod-covered roof. Goats\nand sheep graze nearby.\n“This must be a monastery,” Michelle says,\n- “but look, someone is using it as a farm.”’ As she\n_ speaks, a man walks out of the building.\n__ “And who are you?” he asks.\n“We are travelers from the north,’’ says\n\"M ichelle. “‘And who are you?”\ni - “Auguste le Bon,”’ he replies, “‘late of service\n_ to the Prince of Lyon, but nowI tend this farm for —\n_ the Philosopher Knights.”’\n__ Auguste takes you inside and gives you bread\nand cheese and warm broth. He tells you that the\nPhilosopher Knights spend most of their time\nstudying philosophy and playing chess, but they\nare at present visiting the court of the Prince of\nLyon, who, it seems, fears an invasion by Henry,\nKing of England.\n. ~“Naturally, he has called upon the Phi-\n_l osophers for advice,” says Auguste.\n_ Auguste asks if you would like to spend the\nSight and you and Michelle gratefully accept. In\n_ the morning you ask Auguste if he thinks you can\n~ safely get past the Dragon of the Ledges.\nGoon to page 72.\n\n“T cannot answer that,’”’ he says, ‘‘for I have —\nnever known anyone to try. But I know of a —\nsecret trail through No Man’s Forest. It is possible\nto get through safely, though there is great risk. I\nwill be glad to show you the way, if you like.\nWhichever route you take, you must travel on\nfoot, for the dragon trail is too steep and rugged,\nand the trail through the forest is sometimes no\nmore than a tunnel through the thorns.”\nMichelle beckons you aside. “What do you\nthink?” she says. _\nYou're tempted to choose the dragon trail.\nAfter all, youre from the twentieth century and\nyou know that dragons never really existed. On\nthe other hand...\nIf you decide to go through No Man’s Forest,\nturn to page 74.\nIf you decide to take the dragon trail, —\nturn to page 77.\nIf you decide to wait at the farm until the\nPhilosophers return, turn to page 78. —",
    "choices": [
      {
        "text": "If you decide to go through No Man’s Forest",
        "destination": 74
      },
      {
        "text": "If you decide to take the dragon trail, —",
        "destination": 77
      },
      {
        "text": "If you decide to wait at the farm until the Philosophers return",
        "destination": 78
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 7,
    "text": "“T could vusue a rest, myself,” you Say, as you\ngratefully sit down on the soft moss beneath a\ngnarled old tree.\nMichelle quickly joins you. “We'd best take\nonly a few minutes,” she says. :\nYou lean up against the tree and close your —\neyes. It seems like only a minute later when you -\nopen them again, but at least an hour must have -\ngone by, for the sun has set, and there is barely -\nenough light for you to see the trail ahead.\nMichelle i is sound asleep. :\n“Quick, wake up!”’ You shake her and pull her\nto her feet.\nThe two of you half-walk, half-run along the\ntrail for a few minutes before the darkness closes\nin and you are forced to grope your way through\nthe thorns and brambles, trying to stay on the\ntrail. But it doesn’t matter any more. All around—\nyou, wherever you look, the snakes are coming—\nout.\n= The End\n\nCeeaA\n\n118 ga ie ie, - oe\n“We can’t stop now,” you say. “It will be dark -\nsoon.” |\n-You hurry along the trail, slowing only to push -\nthe thorny branches aside. But darkness comes\nquickly in No Man’s Forest. You strain to see\neach turn in the trail. Then suddenly it grows\nlighter up ahead. A few quick steps and you yell ©\nfor joy—‘‘Michelle, we made it!” Ahead of you is ©\na field of golden grain. On the hillside beyond is a\nstone cottage. Nearby a peasant woman is hoeing\na small garden. You and Michelle run toward her,\nand she looks up from her work.\n“Can you give us some food?”’ Michelle says. .\n“We are lost and hungry.”\n“| would like to help you, but I am a poor serf,”’\nsays the woman. “I work for the lord of the\nmanor, he is a cruel man. Look, there are two of\nhis knights now!” She points to two men riding —\nstraight toward you. v\nRight now you are too weary and hungry to\nresist.\n‘What can we do?” Michelle asks.\nYou look at her and manage to smile. “‘We’ve —\nbeen through a lot, and we’ve learmed a lot.\nSomeday we shall escape. And we shall find the\nForbidden Castle!”’ |\nThe End\n\nkard conceived of the idea for the Choose Your\nAdventure® series in the course of telling _\nries to his children, Caroline, Andrea, and Wells. :\n- ABOUT THE ILLUSTRATOR\nL GRANGER is a prize-winning illustrator and\ninter.\n\nes\nCHOOSE YOUR OWN ADVENTURE®\n20892 6 : The Cave of Time Edward Packard 95cpay\n14003 : Journey Under the Sea R. A. Montgomery 95p\n14005 : By Balloon to the Sahara D. Terman 95p\n14000 : Space and Beyond R. A. Montgomery 95p\n20961 : The Mystery of Chimney Rock Edward Packard 95 0\n20913 : Your Code Name is Jonah Edward Packard 95p\n23185 : The Third Planet from Altair Edward Packard 95p_\n23230 : Deadwood City Edward Packard 95p\n23181 S:S WAhDoR NKiMllNedA WHNar=l owe Thrombey? Edward Packard 95p\n23231 : The Lost Jewels of Nabooti R. A. Montgomery 95p-\n23186 : Mystery of the Maya R. A. Montgomery 95p\n- 23175 : Inside UFO 54-40 Edward Packard 95p\n23332 : The Abominable Snowman R. A. Montgomery 95p_\n23236 : Forbidden Castle Edward Packard 95p\n2254] : House of Danger R. A. Montgomery 95p\n22768 : Survival at Sea Edward Packard 95p\n- 23290 : The Race Forever R. A. Montgomery 95p\n23292 : Underground Kingdom Edward Packard 95p\n23295 : Secret of the Pyramids Edward Packard 95p_\n23294 : Escape R. A. Montgomery 95p_\n23324 : Hyperspace Edward Packard 95p\n23349 : Space Patrol Julius Goodman 95p_\n23366 : The Lost Tribe Louise Munro Foley 95p_\n23733 : Lost on the Amazon R. A. Montgomery 95p\n23661 : Prisoner of The Ant People R. A. Montgomery. 95p—\n23635 : The Phantom Submarine Richard Brightfield 95p__\n23865 : Trouble on Planet Earth R. A. Montgomery 95p_\n23937 DHAMNSO S: OTh™e= C—uHrsRe OoOf RBaMttOerWslWeaI MHaWllN NARiUcNhaNrdN OBrKigYht field 95p\nSKYLARK CHOOSE YOUR OWN ADVENTURE®\n15238 1: The Circus R. A. Montgomery 95p_\n15207 2: The Haunted House R. A. Montgomery 95p_\n15208 3: Sunken Treasure Edward Packard 85p_\n15149 4: Your Very Own Robot R. A. Montgomery 85p\n15308 5: Gorga, The Space Monster Edward Packard 95p_\n15309 6: Green Slime A Susan Saunders 95p\n15195 7: Help! You’re Shrinking Edward Packard 95p\n15201 8: Indian Trail R. A. Montgomery 95p\n15190 9: Dream Trips Edward Packard 95p_\n15191 10: The Genie in the Bottle Jim Razzi 95p—\n15222 11: The Bigfoot Mystery Lynn Sonberg 95p\n15223 ORDMO I 12 O : D T O h C e O D C U re N a AtuArDeA from Miller’s Pond Susan Saunders 95p\n_W w N NYO n N 13: Jungle Safari Edward Packard 95p\n15227 0 14 Search for Champ R. A. Montgomery 95p\n\n\n\nSomewhere south, where it is colder, .\nWhere that which falls stays where itis,\nYou'll find what isn’t what itis.\nCAN YOU SOLVE THE RIDDLE\nOF THE FORBIDDEN CASTLE?\nThe Cave Of Time whirls you back to medieval England.\nYou must solve the riddle that leads to the Forbidd, ~~ as>\ntle, where riches await—and maybe a way home. B ie\nking wants the fortune for himself, and his army ».. 4ht\nbehind you! %\nWhich way do you go? If you go through No Mans Forest,\nturn to p. 74 If you risk the Dragon of the Ledges, turn to\np. 77. Be careful! In this mystical land, anything can\nhappen! |\nWhat happens in the story all depends on th VC\nmake. And the best part is that you can ke —\nrereading until you've had not one, but n =\ndaring experiences!\nCHOOSE YO“R OWN ADVENTUF ==\nISBN 0-553-2323b-3\n| | WP 00095\n\"7305531232363 || |",
    "choices": [
      {
        "text": "Which way do you go? If you go through No Mans Forest, turn to p. 74 If you risk the Dragon of the Ledges, turn to",
        "destination": 74
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 8,
    "text": "‘(Do you know the answer to the riddle?”\nGarth laughs. “I do not even know the riddle. If\nyou want to find out, you must gain admittance to\nKing Henry’s court. You may succeed, but if\nthey suspect you are a runaway serf, they will\nthrow you in the dungeon.”’\nYou have no way of knowing what may lie in ~\nstore at Cotwin Castle. But it’s risky staying with\nGarth. He has said himself that the king’s knights _\nare searching for him.\ncaMcneFpeAotaaetEaDhdSSaaaRneai eteaeTsa a aLd e atRE a at h S lo tieY .NI di e ty\neho)\nceaet ed e\nif you decide to try your luck at Cotwin Castle,\nturn to page 12.\nIf you stay with Garth, turn to page 11. :\n\n‘ou thank Garth for his offer, bid him farewell,\nand set out for Cotwin Castle.\nYou have not gone far when you see a woman\ncoming down the road. She is hunched over—\nalmost hidden by her black shawl—as she walks\nalongside a wooden cart loaded with hay and\npulled bya l ittle gray horse.\nIf you let her pass and continue on toward\nCotwin Castle, turn to page 14.\n; 2 If yous top the woman, turn to page 16.",
    "choices": [
      {
        "text": "NI di e ty eho) ceaet ed e if you decide to try your luck at Cotwin Castle",
        "destination": 12
      },
      {
        "text": "If you stay with Garth",
        "destination": 11
      },
      {
        "text": "If you let her pass and continue on toward Cotwin Castle",
        "destination": 14
      },
      {
        "text": "2 If yous top the woman",
        "destination": 16
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 9,
    "text": "",
    "choices": [],
    "node_type": "ending_neutral"
  },
  {
    "section_number": 10,
    "text": "You cling to the horse, trying to keep from\nfalling off, as the knights gallop to the castle yard. —\nThey drag you down a long flight of crumbling —\nstairs. One of them opens a creaking iron gate.\nAnother shoves you into a dark, musty room.\nThe gate swings shut behind you.\nThe floor of your new quarters is rock. There ;\nare no windows—only a few cracks in the walls —\nthat provide barely enough light for you to see —\nyour cellmate, crouching in the corner. He is very\nthin, and his grimy hair hangs halfway down to —\nhis hips. —\n“Keep away from me!’’ he shouts. “Your —\nclothes were made by the devil... . Don’t come ~\nnear me!”’\n“Please don’t be afraid. | won’t hurt you. But ‘\ndo you know what they will do with me?”\n“Most prisoners are beheaded, but if you are ’\nfound guilty, they’ll burn you at the stake. Itis the —\nonly way to purge the devil from your soul!”\nHe steps closer. “‘Don’t worry. If you’re inno-\ncent, you won’t burn.”’\nYou have only a few moments before your fate\nis sealed. Maybe the guards can help you.\nIf you ask the guards to tell you the riddle of\nthe Forbidden Castle, turn to page 17.\nIf you ask them about what sort of a trial you\nwill have, turn to page 20.\nshah\n“tne",
    "choices": [
      {
        "text": "If you ask the guards to tell you the riddle of the Forbidden Castle",
        "destination": 17
      },
      {
        "text": "If you ask them about what sort of a trial you will have",
        "destination": 20
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 11,
    "text": "Life with Garth may not be easy, or even safe,\nut he is a good friend, and you prefer the dan-\nof the forest to those of King Henry’s court,\nyou join Garth in his forest kingdom.\nHe teaches you to hunt and fish. In the eve- ©\nnings, the two of you sit around the fire, and he\ntells stories of knights and dragons until you fall\nasleep dreaming of days gone by with your family\n-and friends, hundreds of years in the future.\n_ One day Garth turns to you and says, “You\n‘have grown quick and strong, and wise in the\nways of the forest. It’s time for you to decide what\nsort of life you want to live. If you would like a\ndangerous life, where you might find fame and ~\nfortune, you could enter the court of Rufus, the\nwhe\nfad King of Hereford. Or, if you wish, you can\nremain in the forest with me! pp?\nIf you choose to enter the court of Rufus the\nee Mad, turn to page 21.\nvel you choose al ife in the forest,\nturn to page 24.\n\niV eae\na\nGarth wishes you good luck as you shake\nhands and say goodbye. q\n_ As you trudge along the dusty road, your heart |\nis lightened by the sight of flowering trees, the ©\ncheerful songs of birds, and the smells of the -\nsweet summer air. J\nThe afternoon sun is hot when you reach a\nbroad, sloping meadow. You can see Cotwin\nCastle perched on the next hill. Its high stone —\nwalls and tall towers look like a scene from a _\npicture book.\nA bugle sounds as you approach the ramparts. —\nThe great oak gate swings open, and three —\nknights gallop forth. They rein in their horses —\nbeside you. Without a word, one of them lifts you —\nup on his horse, while another prods you with his\nsword. i\npu asi\nny\nW\ns\nRK 0\npsu\nTurn to page 10. ‘\nx ies\n\n4 y i ili\noef e\natC w h\nSaaNNeaatia t nel ad\n) OW idp ay\n\nee",
    "choices": [
      {
        "text": "If you choose to enter the court of Rufus the ee Mad",
        "destination": 21
      },
      {
        "text": "vel you choose al ife in the forest",
        "destination": 24
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 14,
    "text": "You follow the road for what feels like miles,\nwondering whether you will ever find your way to\nCotwin Castle, or even find food and shelter by _\nnightfall. a\nThe sun is beginning to set when a traveler\ncomes riding toward you, his cloak billowing be-\nhind him. ‘\n“Where are you headed?” he calls to you as he\nreins in his horse. You like his warm brown eyes, —\nand the impish expression on his weather-beaten —\nface. .\n‘Pm looking for Cotwin Castle. Am I heading\nthe right way?” you ask.\n“Indeed, you have been heading the wrong\nway,” he says. ““But that is a good thing for you.-\nIf you were ever to reach Cotwin Castle, they\nwould surely throw you in the dungeon. Because\nof the clothes you are wearing, they would think-\nyou are possessed by evil spirits!” a\nEvil spirits! You are surprised that anyone |\ncould imagine you to be possessed by evil spirits. -\nThen you remember that in medieval times evil\nspirits were often blamed for unusual happen-\nings.\n‘What am I to do?” you ask.\n“Just keep going. You are only a mile or so\nfroma f ishing village. When you get there, ask for\nStephen. Tell him that his brother Luke sent you.\nYou can stay with him and his wife. They will\nteach you how to catch any fish in the sea.”’\nYou call your thanks to Luke as he rides off,\nwaving over his shoulder. You continue on your\nway, and soon reach a hilltop. Although it’s\n\n- You think about the life ahead of you—a sim-\n_pler life than the one you thought you would\n_ have—without books or TV or movies, planes or\ncars, or a million other things you took for\nBe ranted. On the other hand, here there is no\n_p ollution, no car wrecks, no bombs. And there\n_ will be plenty of excitement fishing and sailing.\nWill life be better, or worse, than in your own\n_ century?\nThe End\n\n“Good afternoon,” you say. “I am a traveler\nfrom a strange land. Can you tell me where I\ncould find food and shelter?”\nThe woman nods. ‘Follow me.’\nYou fall into step next to the cart, wondering\nwhere she is going. :\n“Could you tell me what year it is?” you ask. —\n“Either 1052 or 1152,” she says. “‘I never can\nremember myself.” :\nYou soon reacha t iny stone house at the edge -\nof the woods. She leads you inside and motions ©\nyou to sit down on a crude oak bench.\n“You wonder who I am.” She speaks with a —\ncackling voice. ‘! um called Madame Leeta. I\nhave prophetic powers, and I can tell that you~\nhave prophetic powers.”\n“Me?” :\n‘You have a magic disk!’ She points to your —\nwrist. You realize that your watch must look —\nmagical to her! :\n“And you can see into the future,” she con-\ntinues. :\n_ You cannot help but nod your head, for at that\nmoment you were looking into the future—think-\ning of your own home and your own time.\nTurn to page 26.",
    "choices": [
      {
        "text": "ing of your own home and your own time",
        "destination": 26
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 17,
    "text": "lease,” you ask the two guards, “‘tell me the\ndle of the Forbidden Castle!”\n_ The taller one looks down at you—a stupid\ngrin on his face—and pushes you through the\n‘crowd of people gathered in the courtyard.\nKnights and ladies in colorful robes are laughing\nnd calling to each other.\n__ In the center of the courtyard is a pile of wood\nstacked around a pole. A man stands next to the\n‘pole, holding a coil of rope in one hand and a\nknife in the other.\n__ The tall guard leans toward you. “The Lord\n‘Chancellor will allow a final request before you\nare tied to the stake.’’ He points to a man, whose\ndark gray cloak reaches to his ankles.\n_ “May I make al ast request?’’ you ask.\nThe chancellor looks at you coldly. “What is\nPye\n_ “Tell me the riddle of the Forbidden Castle.”\n“Little good it will do you,” he says. “But it is a\nsimple enough request.”\nHe steps closer and looks at you curiously.\nThen he says:\n“Somewhere south, where it is colder,\nWhere that which falls stays where it is,\nYou'll find what isn’t what it is.”\nAs you stand there, trying to figure out the\nriddle, the executioner steps forward with his coil\n_of rope. You have only a minute left to live.\n_E scape is impossible.\nGo on to page 19.\n\n\n\nq?, =<\nmar TTT\nS| J A\"\n_ Suddenly, the guards press you up against the\nstake. The rough, prickly rope pulls tight against\nyour waist.\n- You must say something now.\nIf you ask fora l ittle time to solve the riddle,\nturn to page 25.\nIf you say, “Stop! I have the solution to the\nReseae e riddle!” turn to page 28.\n\n“What will happen at the trial?” you ae ap\n‘Do not worry,” one of the guards replies. if\nyou are not in league with the devil you will go\nfree.”’ ,\nThey lead you out into the courtyard. It is filled\nwith knights and ladies, except for a large area in»\nthe middle where a pile of wood is neatly stacked.\n_ “How does this trial proceed?”’ you ask one of\nthe guards.\n“It is simple,”’ he says. ‘They tie you tot he\nstake and light the fire. If you are guilty, you will -\nburn; if you are innocent, you will not be\nharmed.”\nYou try to run for it, but the guards quickly\nap you. Step by step they march you to your >\nloom.\nThe End\n\npeeal for all you’ve done for me,” you\n!G arth, “but now It hink I'd like to see more of\ne ‘world. Pm willing to take my chances with\n_R ufus, the Mad King.”\n“I admire your courage,” says Garth. “Rufus\nSpay like you, and then again he may not, or he\nmay like you one day and hate you the next.\nSome say he is generous, some say he is mean.\n~ You will soon find out.”\n_ For three days Garth travels with you through\nthe forest. When you reach a road that runs\nalongside a crystal-clear lake, Garth stops and\nshakes your hand. “Follow this road for a mile or\nso, and you will reach Fiddlegate, the castle of\n- Rufus the Mad.”\nYou bid him farewell, and start along the road.\n- You miss the company of your friend, but you’re\nhappy to feel the warm sun on your back, and to\nsmell the fresh, clean air of the pine forest.\nThe sun is high overhead when you find your-\nself at the top of a ridge. Ahead of you is a\nbeautiful green valley. Beyond it is a great castle,\nwith a stone tower which seems to be leaning\nslightly to one side. As you approach the front\nentrance, you notice that some of the walls are\ncrumbling and the drawbridge is down. You\n_ would think the castle deserted were it not for\n_ smoke rising from the courtyard and the cows\n_ grazing in a nearby field.\nGo on to page 22.\n\nAs you stand before the drawbridge, wonder-\ning whether to cross it, a bugle blows. After a few\nminutes two guards appear at the entrance. They\nlead you to the large, sunlit courtyard. The yard is.\ncovered with broken slate tiles. Clumps ofw eeds\nand shrubs poke out of the ground. 3\nLap lei\n|)\ni ei o\nhe\nr\nue\n|\n|\niy ys\n=\nevB yt ess\n“Meter o\nUl Clee,\n\neh aA\niia nt‘ iTT y\nHe\nbe = a\ncnn\nier pt\npe HH\nritl\nLlay 7a",
    "choices": [
      {
        "text": "If you ask fora l ittle time to solve the riddle",
        "destination": 25
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 24,
    "text": "You stay with Garth, and live in the forest. You\nbecome strong and tough, and you learn to make\nthe best of the bad and enjoy the good. :\nOver the years, others join you and Garth. ‘\nSome of them are serfs who have run away from |\ntheir masters; others are knights who did not wish -\nto spend their lives fighting for the king. |\nBy the time you grow up, Garth has grown too\nold to live the rough life of the forest. You be-—\ncome the leader of the clan. You make a deal\nwith King Henry to protect travelers passing\nthrough the forest. In return he gives you and\nyour friends a castle of your own.\nIt’s not the sort of life you expected, but it’s as\n- good as you could hope to find hundreds of years _\nbefore your birth!\nThe End\n\ncSca n ie the riddle.”\ne guards laugh in your face.\n_ The chancellor's mouth twists into a cruel\nThe executioner flips a rope over your head Re\nand lashes you to the stake, and your last hope\n; The End\n\n2 6 a Wei: aRea id Be Aa iech oA Ang at\nMadame Leeta looks at you intently. “T shall\nnow tell you the riddle of the Forbidden Castle. —\nNot more than a year ago, it was—an old monk :\nvisited King Henry and told him of a remote —\ncastle with four ivory towers. He called it the\nForbidden Castle, and he told the king that if he\nconquered this castle, he would rule all of ©\nEurope! The king asked how he could reach the\ncastle. But the monk’s only answer was to give\nthe king this riddle:\n“Somewhere south, where it is colder,\nWhere that which falls stays where it is,\nYou'll find what isn’t what it is.”\n“Since then, the king has spread news of the\nriddle throughout all of England, in the hope that — |\nsomeone could solve it. He has offered half the\nkingdom of Wales to anyone who can show him\nthe way! The Baron von Sal, whose lands lie in\nAlsace, is determined to find the Forbidden Cas-\ntle and win the reward, and he has engaged me\nto help him.”’\n‘Have you any idea where the castle is?”” you\nask.\nMadame Leeta stares at you with glittering\neyes. ‘‘We know that the castle lies to the south,\nso we must cross the English Channel and jour-\nney through France. Surely, with your magic\npowers aiding my own we shall solve the riddle,\nand then great riches will be ours.”\nYou are tempted to set out with Madame Leeta\nand the baron. You are curious to see the Forbid- _\nden Castle. And it would be nice to be rich. On ~\n\n+e\nged (| Aen cee\n~ UT tet\nf\n=S EED AZZaZ - A\nthe other hand, you know that you don’t have\nany magic powers, just a wristwatch. How can\nyou expect to solve the riddle? Besides, you are\nworried about how to get back to the twentieth\ncentury. Maybe you could find an entrance to the\nCave of Time near the field where you suddenly\narrived in medieval England.\nIf you say you'll go with Madame Leeta in\nsearch of the castle, turn to page 32.\nIf you say, “No, thanks, I’m more interested in\ntrying to find my way home,” turn to page 33.\n\n“Stop! I have the solution to the riddle!” _ e\nThe executioner laughs. He waves his lighted —\ntorch before your eyes. Suddenly the chancellor —\nsteps forward. ‘Stop the execution!” he saysina\nloud voice.\n“But,” the executioner cries, “the prisoner is\nstalling for time.”’\n“That may be,” says the chancellor, “‘but the —\nprisoner is like none we’ve seen before. Perhaps\nthis is a wizard. This stranger may be the one\nperson who can answer the riddle.”\nThe knights and ladies begin to chant—“To\nthe stake! To the stake!”\nBut the chancellor leads you out of the court- —\nyard and through an archway, beyond which isa ~\nlarge oak door guarded by two men with heavy —\nswords and shields. One of them opens the door,\nand the chancellor leads you to a large octagonal\nroom lighted by casement windows over each of\nthe rough stone walls. At the far end of a long oak\ntable sits King Henry himself. He looks at you\ncuriously as he strokes his long, pointed beard.\n“We have never been so happy as when we\nlearned that you have the solution to the riddle,”’\nhe says. “‘So, tell us what it is!’’\nYou have been trying desperately to think of a\nsolution. You think of the first line of the riddle—\n“Somewhere south, where it is colder.’’ At least —\nyou have a couple of ideas. Normally it will be —\nwarmer, not cooler, if you go south. But the\nmountains may be cooler, even though farther\nsouth, and, of course, the coldest place of all is\nthe South Pole!\n“Well?” The king leans forward impatiently.\n\ne|\nl\ne\nS l\nS\nZ\nS\nE\ne\neS\nE A O\nR B\nN\nRT\nE\n5 T = S\nH2 Se\nr S\ne O 7\nR A S= eren e a\ny\nm T w\nL\nw N A R y S G 2 P P S a\nPS 77",
    "choices": [
      {
        "text": "If you say you'll go with Madame Leeta in search of the castle",
        "destination": 32
      },
      {
        "text": "If you say, “No, thanks, I’m more interested in trying to find my way home,”",
        "destination": 33
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 32,
    "text": "You agree to help Madame Leeta find the\nForbidden Castle. Soon afterward, there is a —\nknock at the door. It swings open, and a man ~\nwalks in. His face is very pale, as though he had >\nnever been out in the sun. Behind him, through —\nthe open door, you see a fine black steed anda —\nsmall chestnut horse.\n“Ah, Baron von Sal—you are early,” says —\nMadame Leeta.\nThe man points to you. ‘“‘Who is this?”\n‘A young soothsayer, who can help us solve\nthe riddle of the Forbidden Castle.”\n‘‘What makes you think so?”\n“Show him the magic disk,”’ she demands.\nYou hold out your watch. The baron bends\nover and looks at it a moment. He nods gravely.\n“Then come at once; a boat is already waiting to\ntake us to France.”’\nMadame Leeta rests a long, bony hand on —\nyour shoulder. “I knew you would come with us.\nThe three of us shall find the Forbidden Castle,\nand half the kingdom of Wales shall be ours!”\n~ Turn to page 48.\nee\n\nter leaving Madame Leeta you try to retrace\nour steps back to the field where you first found\nyourself; Following at rail through the forest, you\ncome to the hut of a woodsman who gives you\nfood and drink.\n“Where are you bound?” he asks.\n_ “T came here from another country and\nanother century through the Cave of Time. I’m\ntrying to find the entrance so | can return to my\nown time and my own home. Do you know of\nMe\n-You wonder if the woodsman will laugh at your\nstrange story, but he nods his head and replies,\n“You're not the first one to visit from another\ntime and place. Since you arrived here, you have\nwalked in a circle. The Cave of Time is almost\nbeneath us. I could show you a tunnel that leads\nto it.”\n“IT would be most grateful,’’ you say.\n“T do not know how grateful you should be,”\nhe says. “You might find yourself in a time when\nthe world had turned to fire, or to ice!”’\nYou are happy to have learned how to get\nback to the Cave of Time, but, now that you\nknow where it is, you wonder whether it wouldn’t\nbe fun to stay in medieval England awhile. Maybe\nyou can solve the riddle and find the Forbidden\nCastle.\nIf you decide to take the tunnel back into the\nCave of Time, turn to page 40.\nall you decide to stay in medieval England,\nturn to page 41.\n\n“The Forbidden Castle is to the south,’”’ you ©\nsay, “‘but high in the mountains, where it is\ncolder.”’ 7\nThe king begins to pace around the room. ©\nYour heart is pounding. Will he praise you, or —\nsend you to your death?\nSuddenly he turns, smiling. ‘“There is wisdom —\nin what you say. I know that in the south of\nFrance there are mountains higher than any in —\nEngland, and their tops are covered with snow,\nwhile flowers-bloom in the valleys below. Now\nwhat is the rest of the solution?” ;\nYou think of the next line of the riddle: Where\nthat which falls stays where it is, but you can\nhardly even guess at the solution. Could it have\nsomething to do with the setting sun? The sun ~\nfalls below the horizon, yet really stays where it\nis...\nIf you say, “The second line has to do with the\nsetting sun,” turn to page 42.\nIf you say, “We must go to the southern -\nmountains; then I will be able to tell you,”\n, turn to page 43.",
    "choices": [
      {
        "text": "If you decide to take the tunnel back into the Cave of Time",
        "destination": 40
      },
      {
        "text": "all you decide to stay in medieval England",
        "destination": 41
      },
      {
        "text": "If you say, “The second line has to do with the setting sun,”",
        "destination": 42
      },
      {
        "text": "If you say, “We must go to the southern - mountains; then I will be able to tell you,”",
        "destination": 43
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 36,
    "text": "‘The Forbidden Castle is to the south,’ you\nsay, ‘“‘on the way to the South Pole, where it is\ncold!”\nThe king rises, his face reddening with anger.\n“What nonsense are you telling me? What is this\nSouth Pole you speak of?”\nSuddenly you realize that the South Pole can’t\npossibly mean anything to the king. It won’t be\nreached for hundreds of years! You try to answer,\nbut the king roars at his guards. They pick you up\nlike a sack of potatoes, and carry you through the\ndoor.\n“Prepare for execution!’ the king calls. “And\nbe quick about it!”\nThe End",
    "choices": [],
    "node_type": "ending_win"
  },
  {
    "section_number": 37,
    "text": "_ You look the king in the eye. “I would not\n_b ring sorrow. I mean no harm.”\n_ Stillwell jumps up and down. “He disobeyed\n- your highness’s command to be silent.”’\n“Indeed he did.” The king’s face is red with\nanger. ‘‘Take this impudent youth to the tower!”\nTwo guards lay hold of you and drag you out\nof the courtyard. Once outside, one of them ~\nglares at you sternly. The other guard starts\nlaughing, yet it is not a cruel laugh—his blue eyes\nare sparkling.\n“The king does not know it,” he says, ““but the\n_ tower steps have long since crumbled away. We\nhave not been able to enter the tower for years!”\n“Then what will happen to me?”\n“Why, you will escape, of course!” says the\nother guard with a laugh. Surprised and pleased\n_ by their rough kindness, you laugh too!\n_ The guards give you a pack filled with bread\nand cheese and fruit. They also give you direc-\ntions to Cotwin Castle. “May you have better\nluck in King Henry’s court. At least he is not\nmad.”\nAnd so, you cross the drawbridge of Fiddlegate\nCastle and set out for Cotwin Castle.\nBs: Turn to page 14.",
    "choices": [
      {
        "text": "Castle and set out for Cotwin Castle. Bs",
        "destination": 14
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 39,
    "text": "ou’re afraid to disobey the king, so you say\nothing.\n“Well,” the king shouts. “‘Can’t you speak?’ g\n| Before you can answer, the jester says, “I sug-\ngest you teach this youth a lesson!’\n“Stillwell, only a fool like you would surely\nknow what not to do!” says King Rufus. ‘Why\nhaven't | locked you up in the tower?”\n“Because, your majesty,” says Stillwell, ‘“‘if you\nwere to lock me up, it would mean you’d made a\nmistake when you appointed me. Since you are\nperfect, you cannot make a mistake. Therefore,\nyou cannot lock me up.”\nThe king scowls and paces up and down. Fi-\nnally he turns to you.\n“You have fallen into my favor,” he says.\n__ “Tt would have been better to have fallen in the\n-moat,”’ says Stillwell.\n_ The king smacks Stillwell over the head with\nthe flat side of his sword. Turning to you he says,\n“Tf you agree to serve in my court, I shall make\nyou one of my ministers!”’\nThe king seems to have taken a liking to you.\nHe’s mad, all right, yet there may be method to\nhis madness. Maybe he would even help you find\nthe Forbidden Castle.\nIf you dare ask King Rufus to help you find the\nForbidden Castle, turn to page 44.\nIf you agree to serve in his court,\nturn to page 45.\n\njive ie < J eat RlK t S$ QO Ped Fe &. eeeG ate aes at 7) »\nNS > t 2 Melman wee Uae atts Aces vada ad\n| 0 ss = ra MSR Pane SUBS Sas\nThe woodsman shows you the tunnel that\nleads to the Cave of Time. You thank him for his —\nhelp. Then, summoning your courage, you crawl |\nin through the narrow entrance. ’\nYou shiver in the cold damp air as you inch —\nyour way along the dark, musty passageway that —\nwinds down into the depths of the earth. Sud- ©\ndenly you are falling, faster and faster, falling into\nthe future!\nThe time in the future toward which you are\nfalling has not yet come. But it will, and, when it\ndoes; your adventure will continue.\nSo it is only for a while that this is\n&\nThe End\nx} Ss\n\n<e 41\nBy You agre that ne to the Cave of Time\nnay not be such a good idea, and ask the woods-\nman if he knows the way to King Henry’s court.\nThe woodsman gives you directions to Cotwin\nCastle. You thank him for his kindness and set\n_ out on your journey.\n__ Soon, heavy gray clouds begin to fill the sky.\n_T he wind blows harder. The sky darkens. You\n_ hear thunder in the distance. As you start across a\nbroad field, sheets of rain suddenly pour down.\nYou run to the shelter of a big pine tree. If only\n_ there were a house nearby! You have no rain\ngear and no place to go. In a minute there is\nthunder and lightning everywhere around\nRVOU. . .\\.\nIf only you had remembered never to stay\n_ under a tree in an open field during a thunder-\nstorm, your story would not have come so\n- quickly to\nThe End\n\nYou look the king in the eye and try to sound ~\nas if you know what you're talking about. “‘We\nsee the sun fall below the horizon when it sets, —\nbecause the Earth is turning. The sun itself stays\nwhere it is!”\n‘What do you mean, the Earth turns?’ The\nking points his finger at you. “You would try to\nmake a fool of me! What you speak is heresy.\nAnyone can see that the Earth does not move,\nbut it is the sun that travels around the Earth\nevery day!”\nIf only you could show the king he is wrong,\nbut the guards quickly seize you and drag you\nback to the dungeon. You wonder if you’ll ever\nget out.\nYou don't.\nThe End\n\n(43\n“We must go to the southern mountains,” you\n“Then I will be able to tell you.”\nThe king frowns. He heaves a sigh and says,.\n“Very well. I shall provide a ship which will take\nyou to France—a day and a half’s voyage from\nDover, given a fair wind. There shall go with you\nthe Earl of Kent and three of my best knights.\nMeanwhile, I shall gather my army together—\nenough men to conquer any castle—and we shall\nfollow within the week. Soon all of Europe will be\nmine!” He smiles a broad smile. Then, pointing a\nfinger at you, he says, “‘But if you do not find the\nForbidden Castle, I will see you hang from the\ntallest tree in England!”\nTaking care to speak in the manner of the\n“court, you say, ‘‘Never fear, my lord, I shall find\n_this castle before the next full moon. Then, as the\n-monk foretold, all Europe shall do homage to\nyour sword!”’\n_ “Well spoken,” says the king. “Now, make\nready, lords, knights, and vassals. We journey to\n_ France!”\nTurn to page 57.\n\nf 4 é © im. am\nLooking the king straight in the eye, you say, “T\nthank you humbly for offering me such an honor,\nyour highness, but I wish to find the Forbidden :\nCastle. Would you help me?”\nThe king shakes a finger at you. “Impudent —\nyouth! I am KING! You are my subject. I don’t ©\nhelp my subjects. They serve me!”’\n“Well, I can help you. I can win half the king-\ndom of Wales by finding the Forbidden Castle. ©\n~ Help me and I'll give you half of my kingdom.”\n“Half your kingdom? I'll take half again as\nmuch as a half,” says the king.\n“Pll give you half of half again as much as\nhalf,” you quickly reply.\n“Call the royal mathematician,” says the king\no\nto Stillwell. Then he looks at you as he strokes his\nlong, droopy mustache. ‘You may have wit\nenough to find the Forbidden Castle. Tomorrow\nwe shall leave at sunrise. And by our deeds,\nRufus shall be king of Wales!’\nThe trumpeters blow their horns, and everyone\nbows as the king struts out of the royal courtyard.\nYou stand there wondering whether you and he\nwill find the Forbidden Castle. Perhaps the world\nwill be better off if you don’t! :\nThe End\n\n| : would be honored to serve in your court, my\n_ “Very good,” says the king. “Tonight we shall\nhave a banquet in my honor to welcome you.”\n_ ~Stillwell leads you upa spiral staircase to your\n‘new quarters—a tiny room with stone walls, and\nnothing more than a bed of straw and a hole in\nthe wall for a window.\nYour bed is almost as hard as the floor, but you\nlie down for a-nap, for it’s been a long time since -\n-you’ve had a good night’s sleep. It seems no\n‘more than a minute later when you are\n~ awakened by a knock on the door.\n“Who is it?”\n“A page, sent to say the banquet is about to\n_ begin!”\n_ The page leads you down the long spiral stairs\nto the great banquet hall. Peering through the\narchway, you can see that most of the guests are\nalready seated. Your mouth waters at the sight\nand smell of roast goose, onions, and gravy. As\n- you start to enter the hall a great hulk of a man\nblocks your way.\n“You may not enter!” he says.\n“But the king himself invited me!”\n“The king did not invite you.”\n__ “4What do you mean?” you ask. ‘‘Who are you\n_ to contradict me?”\n“The Minister of Contradiction!” he replies.\n“What kind of title is that?”\nGo on to page 47.\n\ng.\n4 Z g:-\nwef e 0 5 to Us . ao re\n|\nTO\nMM\nSSS\nSS\nS\nS RSS\neee PasiR Ri OS N\nPiOeSc)H e e\n\n‘It mwye b he says. “Too many.P people in\n; kingdom were contradicting each other, so\n1e king banned it. He has decreed that all con-\ntradicting in the kingdom shall be done by me!”’\n_ “Ts everything you say a contradiction?”’\n_ “NO! The king has ordered me to contradict\neverything that is said by anyone but him.”\n_ “Then I can not come to the banquet!”’ you\n“Oh, yes you can!” he shouts.\n- He steps back a moment, and you dash into\nthe hall and quickly take an empty seat at the\ngrand table. On your left is an old knight with a\nlong, sad face; on your right is a woman wearing\na white dress adorned with lace.\n_ “Who are you?” you ask the woman.\n“Tam the Lady in Red,” she says.\n“But your dress is white.”\n' “How dare you contradict me?’ she says.\n“Only the Minister of Contradiction can do that.”\n‘Turn to page 51. |\n\nPainam ae\nCet IW I ee\nAfter a rough channel crossing and a ionic a\ntravel across the French countryside, you and\nMadame Leeta and the Baron von Sal have fi-\nnally reached the south of France. The mountain\ntrail you are climbing is steep, and you are all\nbreathing hard under the weight of your packs.\n“Are you sure the castle is in the mountains?”\nthe baron demands.\n“Of course!’’ Madame Leeta snaps. “That’s\nthe only explanation for the first line of the rid-\ndle—somewhere south, where it is colder. If you\n_ go south, it gets warmer, unless you go into the\nmountains!”\n_ Suddenly she stops and glares at you. “But\nnowi t is time for you to tell us the solution to the\nsecond line of the riddle—where that which falls\nstays where it is.’\n“Yes,’’ says the baron. ‘“‘Iti s time foty ou to use\nyour magic disk!”’\nYou glance at your watch, pretending that it\nmight be able to tell you something other than\nwhat time it is.\nShould you admit that you really have no\nmagic powers, or should you bluff and hope that\nsomehow you will solve the rest of the riddle and -\nfind the Forbidden Castle?\nIf you admit that you don’t think you can solve\nthe riddle, turn to page 52.\nIf you tell the others not to worry, that you'll\nsolve the riddle soon, turn to Page 53.\n\nA\nif4‘ 6 e sG\nNMV ANNN Hi\nNAN\nA{M aa yiYA] )K H) Ai\nUP AM\ny / U W f y pi i h Y ;\nH)Wy p\nf yf De\nVy HY)\n; //",
    "choices": [
      {
        "text": "If you dare ask King Rufus to help you find the Forbidden Castle",
        "destination": 44
      },
      {
        "text": "If you agree to serve in his court",
        "destination": 45
      },
      {
        "text": "If you admit that you don’t think you can solve the riddle",
        "destination": 52
      },
      {
        "text": "If you tell the others not to worry, that you'll solve the riddle soon",
        "destination": 53
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 50,
    "text": "~ You step into the cave, then wait for your oye a\nto adjust to the darkness. But Michelle goes on a\nfew feet ahead. Suddenly she cries out. “Help, —\nI'm sliding!”\nYou grab her arm and try to pull her up, but\nnow you're both falling . . . falling. .\nIt is broad daylight. You and Michelle are both\nsitting in a field. There is a paved road nearby. A\nGreyhound bus is going by. A big tractor-trailer is\nright behind it. Whoosh, an oil truck whizzes by.\nMichelle screams. ‘What are those monsters?\n_ What a noise! It is horrible!”\n“Everything’s OK,’ you say, as you look\nacross the road at the familiar sign that makes you\nwonder how Michelle would go for a Big Mac and\na shake.\nThe End\n\numing to the knight on your left, you ask,\nAnd who are you, sir?”\n“The Minister of Laughter,” he says with a\nJaugh.\n_ “What does that mean?”\n_ “I decide what is laughable and what is not.”\nHe frowns.\n- You cannot help but laugh.\n_ The minister reddens. “How dare you laugh\nwithout my permission?”\n:_ At that moment the king stands up and calls for\n‘silence. “We welcome a new member of the\ncourt.” Pointing at you, he says, “Rise.”\n— You stand up, and the king unrolls a long\nscroll. “Hmm, we have just appointed a Minister\n_of Craftiness, a Minister of Happiness, a Minister\nof Inaction, and a Lady of Ladies in Waiting.\nThere are only two openings left. Tell us which\nposition you would prefer. Would you rather be\n‘the Minister of Guesswork, or the Minister of\nSanity?”\n_ You look around, hardly able to believe what\n‘the king has said. Only now do you fully under-\nstand why he is called the Mad King. Absurd as it\n‘is, you can see you'll have to pick one job or the\nother.\nIf you say you’d rather be the Minister of\nGuesswork, turn to page 60.\nIf you say you’d rather be the Minister of\n: Baa Sanity, turn to page 61.",
    "choices": [
      {
        "text": "If you say you’d rather be the Minister of Guesswork",
        "destination": 60
      },
      {
        "text": "If you say you’d rather be the Minister of : Baa Sanity",
        "destination": 61
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 52,
    "text": "“T really don’t think I can solve the riddle,” you\nsay. os\n‘You impostor!”’ the baron cries. He lunges at\nyou, but you are already running down the\nmountain. He races after you, and, as you look\nback, you see him trip over a rock and crumple to\nthe ground. In a moment he is up again and\nlimping after you, but you know that he’ll never\ncatch you!\nYou continue down the mountain, following\nthe sound of church bells until you reach the tiny\nvillage in the valley below. There you find refuge\nwith a kind family. They offer you food and shel-\nter in exchange for your promise to tend their\nsheep and goats.\nAnd so you begin a new life in which you\nresolve each day that, when you grow up, you\nwill climb the mountains and find the Forbidden.\nCastle. Only then will you be ready to return to\nthe Cave of Time.\nNe\nNae\nbni il “4\n\noone. ” 99\n__ The baron grumbles, but you pay no attention\nto him as you lead your companions higher and\nhigher up the mountain trail. If you can only get\nto the top, you'll be able to see for miles in all\ndirections.\n- You keep climbing. It’s getting cold, and you\n- seem nowhere closer to the top. You pause to\nrest, not daring to look the baron in the eye, and\nat that moment you hear, very faintly, a rushing\nsound. Is it the wind, or is it water?\n“Follow me,” you say, and you start climbing\n_toward the sound. Madame Leeta and the baron\nfollow eagerly. You cannot be sure where you are.\n| headed, but at least you are getting somewhere.\n.\nGo on to page 54.",
    "choices": [
      {
        "text": "Go on to page 54",
        "destination": 54
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 54,
    "text": "You walk along the side of the curving moun-\ntain path. Soon you come to a clearing. From\nhere you can see a spectacular waterfall, and\nbeyond that the gleaming white walls, the four\ntowers of the Forbidden Castle!\nUl re 1 ile Use\nfVA Y) {maU e he\nZ <r ee\nAYWY) a WA y ) tte Bs G ‘ Ae if 7 = = 2 a 2 a—— = S o !=\nwo\n(i ll Z ji U\n7 ‘\nTurn to page 56.\n\n\n\nYou and Madame Leeta and the baron hurry\nover the rocks, and continue along the steep,\ntwisting trail. Finally, almost breathless, you reach\nthe castle gate. A tiny woman dressed in a long\ngray habit comes forth to meet you.\n‘Tam Sister Anna,”’ she says, “‘and I welcome\nou.”’\n‘Who is the ruler of this castle?” demands the\nbaron.\n“There is no ruler. The castle is tended by the\nSisters of Hope,”’ the woman replies. “‘It is used\nonly as a refuge for the poor and sick.”’\n“Ah!” the baron exclaims. “Then King Henry\nwill have no trouble conquering it. As the monk\nforetold, he shall become ruler of all of Europe,\nand I shall become ruler of half of Wales!”\n“He could conquer it,’ Sister Anna says\ngently, “but he will not. To do so would violate\nthe code of chivalry, and he would soon be be-\nsieged by all the princes and knights of Europe.”\n‘“‘Achh,” the baron cries. “‘She is right! King\nHenry will never rule Europe, and | shall never\nrule Wales! We have journeyed here for nothing!\n... nothing! ... nothing! ...”\nThe baron turns and starts down the trail.\nMadame Leeta runs after him, screaming, ‘‘Stop!\nStop! I led you here, and now you must pay me!”\nSister Anna smiles at you. “You have traveled\na long way. Stay with us for a while. Listen,\nobserve, and meditate, and you will find your\njourney worthwhile.”’\nTurn to page 66.\n\n(6)S end half att he next day fosting.d own\nThames River on the royal barge. It docks in\nLondon, and though you are eager to see the\nancient city, the Earl of Kent has other plans. He\nswings you up onto his horse and begins riding\ntoward the southern shore.\n__ The smell of the fresh sea breeze and the flocks\nof gulls circling overhead tell you that you have\narrived in Dover, where one of King Henry’s\nships is waiting to take you across the English\nChannel.\nYou are glad to be safe for the moment. But\nyou keep thinking about what will happen to you\nif you can’t find the Forbidden Castle. The more\nyou think about it, the more you think you’d\nbetter escape.\nEarly the next morning, you, the earl, and\nthree of his knights set sail on one of the royal\nships. The voyage is a smooth one, and shortly\nbefore noon the next day, you step onto the\nfertile soil of France.\nThe Earl of Kent and his knights mount their\npowerful war-horses. You are ordered into the\nback of a wooden cart. Though the ride is bumpy\nand you would rather be on one of the horses,\nyou begin to enjoy the beautiful countryside.\n_ It is late afternoon when you come to a tavern.\n“We will stop here,” the earl calls to the driver.\n“It is time to load our casks with good French\nwine. You will wait here; we shall not be long.”’\nGo on to page 59.\n\nKafi Sy A )|\noe\nOX\na\nSs o\nx\nSouth\nfe\nTH)\nihe oA T i",
    "choices": [
      {
        "text": "Z <r ee AYWY) a WA y ) tte Bs G ‘ Ae if 7 = = 2 a 2 a—— = S o !=",
        "destination": 7
      },
      {
        "text": "Go to section 56",
        "destination": 56
      },
      {
        "text": "journey worthwhile.”’",
        "destination": 66
      },
      {
        "text": "wine. You will wait here; we shall not be long.”’ Go on to page 59",
        "destination": 59
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 65,
    "text": "ou run as fast as you can. As you reach the .\nge, you look back toward the tavern. The Earl\nf Kent and his knights are galloping toward you,\ntheir swords drawn.\n- You force yourself to run even faster. Your | |\nheart is pounding. As you start across the narrow\nbridge, you hear the horses right behind you.\nAnd you jump!\nYour right leg hits a jagged boulder. Then you\nfeel only the shocking numbness of the icy water.\nYou struggle to keep your head above water.\nYou gasp for air. The racing current sweeps you\ndownstream. Again and again the swirling black\nwater pulls you under.\nYou are barely conscious now. The current has\nswept you against a fallen tree. The water is\ncalmer. You work your way ashore and crawl up\nthe steep muddy slope. As you reach the tall grass\nalong the bank, you collapse. Your leg is bleed-\n‘ing, and you feel so exhausted and bruised that\nyou hardly care whether or not you’re alive.\n_ That’s a good thing, because in a minute you\nwon't be.\nThe End",
    "choices": [],
    "node_type": "ending_win"
  },
  {
    "section_number": 66,
    "text": "The Sisters of Hope give you a room of your >\nown. Each day they tell you wonderful stories of-\nkings and knights and dragons. You learn to\nweave tapestries and play the lute. You swim in\nthe sparkling pool beneath the waterfall, and ride\n_ the mountain ponies. But, as good as life is, you\nbecome more and more homesick.\n“What is troubling you?”’ Sister Anna asks one\nday.\n‘I dream of finding the entrance to the Cave of\nTime so that I can return to my home in the\ntwentieth century.”\n“It need not be a dream,” she says and hands\nyou a tiny wooden pipe. “If you blow on this\nreed, it will summon the unicorn. You need only\nfollow it, and it will lead you to the Cave of\nTime.”\nYour eyes open wide. “But | thought unicorns\nnever really existed.”\n“Oh, but they do,” she replies, ‘though you\nwill find it difficult to believe when you return to\nyour twentieth century. You may not even be-\nlieve you visited the Forbidden Castle, and yet\nyou will not forget it. As you dreamed of your\nown home here, so will you dream of the Forbid-\nden Castle when you return to your own time.”\nThe End",
    "choices": [],
    "node_type": "ending_neutral"
  },
  {
    "section_number": 67,
    "text": "You dash around the side of the tavern, keep-\nng as low as you can, so as not to be seen\nhrough the casement windows. As you round\n_the rear comer, you almost crash into a young girl -\nwith the longest braids you’ve ever seen.\n_ “What are you running from?” she asks, but\n_she gives you no time to answer. “My name is\nMichelle. I live in the tavern. Come, I will show\nyou where to hide.”\n~ You follow her down a steep flight of stone\nsteps, through a dark passageway, and into a\nsmall room filled with casks of wine. The only -\nlight comes from a few cracks between the stones\n‘in the wall.\n“Twill bring you food and milk when it is safe,”\n_ she says. Then she turns and hurries up the stairs.\nYou sit in the cellar, wondering what will be-\ncome of you. When will Michelle return? You\n_ would like to sneak upstairs to get some food, but\nyou don’t dare. King Henry’s knights will surely\n_be looking for you.\nA few minutes later the door swings open, and\n‘Michelle steps in, carrying a plate heaped with\nfood.\n‘T_amb, pears, and fresh bread,” she says.\n“The cook is a friend of mine. I’ve good news,\ntoo. The English knights have left. They think you\n_ are hiding in the woods.”\n: Go on to page 68.",
    "choices": [
      {
        "text": "_ are hiding in the woods.” : Go on to page 68",
        "destination": 68
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 68,
    "text": "While you eat, you tell Michelle about every- —\nthing that has happened since you arrived in\nEngland hundreds of years before your birth. |\nShe listens intently, and when you have\nfinished she says, “It is a strange story you tell,\nbut I am very glad you have come. My parents\ndied when I was a small child. The innkeeper said\nI could live at the inn if | swept the floors and\nhelped the cook. Now he works me night and\nday, and beats me if I complain. I have been\nafraid to run away alone, but we can go\ntogether.”\n“How?”\n“The cook will give us packs of food. I will take\nblankets and two good horses. The moon will be _\nfull tonight. We will ride the road south. There is\njust one more thing. You cannot expect to hide ~\nfrom anyone in those clothes. See what I’ve\nbrought?” She hands you a small bundle. “Put\nthese on!”\nIt is near midnight when Michelle comes to get\nyou. A few moments later the two of you gallop\ndown the road, free!\nTurn to page 81.\n\nee OG te ee\nel\nCOMMIT IL)\nkl\n5 oI hn SS\nif Gir\noh SING\n(|\nSS =\nBi\nee\ngS,\nRes\neSa es SpSSS",
    "choices": [
      {
        "text": "down the road, free!",
        "destination": 81
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 74,
    "text": "You and Michelle follow Auguste through a ©\nforest of towering pines. Late in the day you\nreach a slow-moving, muddy stream. A huge\nfallen tree forms a bridge across it. Beyond the\nstream are the thickest woods you’ve ever seen.\n“You can camp here for the night,”’ says Au-\nguste. “The trail through No Man’s Forest begins\nat the other end of the bridge. If you start out at\ndawn, and travel at a good pace, you will be\nsafely through the forest by sunset. But do not\nstop to rest. The snakes come out at night.”\nEarly the next morning you and Michelle care-\nfully cross the bridge and set out on the trail\nthrough No Man’s Forest. You follow a twisting\nroute which winds around great clumps of thorns\nand plunges down into gullies and up steep\nridges. Each of you carries a stick to brush aside\nthe thorn branches which hang down across the\npath. ,\nYou walk briskly along without rest, until the\nsun sinks low in the western sky and the forest\ngrows darker. If only you knew how much farther\nyou had to go!\n“lam so tired I can barely walk,” says Michelle.\n“Can we stop for just a few moments?”\nIf you agree to rest for a few minutes,\nturn to page 116.\nIf you insist on pushing on, turn to page Hg\n\n\n\n\n\nTeo e\n.et’s take a chance, and follow the dragon\ntrail,” you tell Michelle.\n_ You thank Auguste for his help, and start up\nthe narrow winding trail that leads past the Dra-\ngon of the Ledges.\nYou’ve been traveling about half a day when\nMichelle stops, so quickly that you bump into her. —\nLooking ahead, you see that the trail leads into a\nclearing. Scattered about are piles of bones—\nwhether animal or human you cannot tell. Sud-\ndenly, you hear a hiss. A puff of smoke floats\ntoward you from behind a huge boulder att he far\nend of the clearing.\n_ Michelle clutches your arm. “‘The dragon! It is\njust beyond that big rock!”\n“In the twentieth century, we don’t believe in\ndragons,” you say.\n_ “You are not in the twentieth century!”’ says\nMichelle. ‘Believe me, there are dragons in this\ncentury!”\nYou stay absolutely still. The hissing continues.\nPuffs of smoke drift toward you. You try to keep.\nfrom coughing. You wonder whether you can\noutrun a dragon. You’re scared, but you are also.\ncurious.\nIf you continue on through the clearing,\nturn to page 82.\nIf you retreat, turn to page 85.",
    "choices": [
      {
        "text": "” If you agree to rest for a few minutes",
        "destination": 116
      },
      {
        "text": "If you continue on through the clearing",
        "destination": 82
      },
      {
        "text": "If you retreat",
        "destination": 85
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 78,
    "text": "“Tet us wait for the Philosophers to return,” —\nyou say. Michelle agrees.\nWhen you tell Auguste that you do not wish to\ngo to No Man’s Forest, he shakes his head.\n“Well,” he says, “I cannot blame you, for the —\npath I would have shown you is a dangerous one.\nThe truth is that, in this country and in these\ntimes, whatever you do, the odds are against\nyou.” .\nFor the next two days, you and Michelle help\nAuguste feed the chickens and milk the goats. At\ndusk you take one of the dogs and bring the\nsheep in from the pasture. It’s good to have a\nbreak in your travels, but you can’t stop thinking\nabout the Forbidden Castle. You ask Auguste\nwhat he knows about it and he shudders. ‘“Terri-\nble things have happened there. It is best you do\nnot ask.”’\nYou are glad when you finally see the Phi-\nlosophers riding up the road. They are a scraggly-\nlooking lot—of all ages and manner of dress—but\nthey introduce themselves politely, and thank\nyou earnestly for helping Auguste take care of the\nfarm. .\nThat evening you sit down to a dinner of mut-\nton and beans. The food is good, but the Phi-\nlosophers pay no attention to you or Michelle.\nInstead, they spend the whole meal arguing over\nwhether a waterfall makes a noise when there is.\nno one close enough to hear it. After dinner they\nretire to their chambers, except for Sir Bertram\nand Sir Gregory.\n“Where are you bound?” asks Sir Bertram.\n“To the Forbidden Castle,”’ you reply.\nSir Bertram raises his eyebrows. “Then you |\n,\n:\nis",
    "choices": [],
    "node_type": "ending_neutral"
  },
  {
    "section_number": 79,
    "text": "x yy\nY WGAAL p) Tj ig,\nC W Vi S GEI EP GE LA S TP :E L .LA . U . S y S\nLL LUE ALE\nmust take the trail past the Dragon of the Ledges.\nAm I not right, Sir Gregory?”\n“Quite so,” Sir Gregory replies. “But do not be\nalarmed—i t is simple enough to scare the dragon ~\naway. Catch a few mice, put them in a cage, and\nlet them loose in front of the dragon. Then just\nkeep out of its way when it runs.”\n“How do you know the dragon will be afraid of\nmice?”’ you ask.\n_ “It is simple, just a matter of logic: all elephants\nare afraid of mice. Elephants are large animals.\n_ Therefore all large animals are afraid of mice.\n_ Since dragons are large animals, all dragons must\nbe afraid of mice.”\nIf you decide to follow Sir Gregory’s advice,\nturn to page 86.\n;\nIf you decide not to follow Sir Gregory’s .\nNg advice, turn to page 87.\n\nae\n80 Ces\ntT ene\n4 & eeae:\nOy\nUsing the sun as your compass, you and —\nMichelle continue on foot, heading southeast,\nhoping that you may safely pass through Count\nGaston’s lands without being seen by his men.\nLater that day, after traveling through a pine\nforest, you are glad to see a broad stream up\nahead, and rolling fields beyond it.\n“I think we have reached the lands of Count\nGaston,” says Michelle.\nNo sooner has she spoken than you hear the\nhowling of a wolf behind you; then another to\none side—much closer. And another!\n“They are on our trail,” says Michelle. “It will\nnot be long before they find us.”’\nAs she talks, you look for something to use as a\nweapon. You pick up a fallen branch and break it\nin two. Now you have a good club. You can —\nprobably defend yourself against a single wolf,\nbut you hear others, much closer! The pack is\n‘Closing in.\nMichelle points to a tall pine with branches\nreaching almost to the ground. “‘Quick! Climb up\ninto that tree.”\nYou had the same thought, but another idea\noccurs to you. If you could walk through the\nstream for a way, the wolves would lose your\nscent, and you could escape on the other side of\nthe stream.\nIf you run to the tree and climb it, ©\nturn to page 88. —\nIf you tell Michelle to follow you, and run for\n_ the stream, turn to page 89. —\n\nr two days you and Michelle ride the trail\nouth, stopping only long enough to get some\nleep and let your horses rest.\nOn the morning of the third day, you reach a\nork in the trail, where you meet a shepherd.\n‘““Good morning, friend,” you say. “Could you\nell us which trail will take us south to the moun-\ntains?”\n_ The shepherd looks at you wuiceall: and —\nshakes his head. “‘I could not say, except to say\nyou cannot go south by going south.”\n_ ‘What new riddle is this?”’ Michelle demands.\n“It is no riddle,” the shepherd replies, ‘“‘but a\nsimple truth, for to the south of us lies No Man’s\nForest, where the trails are blocked by thickets\nnd thorns, and deadly snakes await you under-\noot and above, dangling from the trees. So, if\nou want to go south, you first must go east or\nest.” .\n‘What lies to the west?” you ask. :\nThe shepherd frowns, and says, ‘‘The trail to\n_the west winds up around high, rocky hills, where\nthe January wind blows in July and the Dragon of\nthe Ledges waits for foolish travelers.”’\n_ “And to the east?” asks Michelle.\n“To the east are the lands of the Count Gas-\nton, where half the wolves in Europe roam.’\n5, You and Michelle exchange glances. ‘“We can-\nnot turn back now,”’ she says. “We must go east\nor west. They both sound bad to me.’\nIf you head west, turn to page 71.\nhaul you head east, turn to page 73.\n\n«82\n‘We've come this far,” you whisper to Mi-\nchelle. “I’m not going to tum back now.”\n_ As quietly as you can, the two of you pick your\nway through the bleached white bones, hoping.\nthe dragon will not hear you. Michelle regains her\ncourage and follows close behind. But the hissing\ngrows louder. Sparks, glowing cinders, and bil-\nlowing puffs of smoke fill the air. Looking down,\nyou see the empty eye sockets of a human skull\nstaring up at you. Gritting your teeth, you con-\ntinue past the rock, steeling yourself to face the\ndragon.\nThere before you is a fire of blazing pine\nboughs. Sitting beside it is an old man with a\nlong, white beard. He holds a blacksmith’s bel-\nlows to the flames and blows fire and sparks\n_ toward you. You jump back just in time to avoid —\nbeing singed by the leaping flames. He seems too\nbusy to notice you, as he lifts a ram’s horn to his\nmouth and blows an eerie, wailing blast—the\nterrible sound of the Dragon of the Ledges!\nMichelle runs up, Jaughing.\nThe old man lays down his bellows and his\nhorn. He stands there—hands outstretched.\n“You have met the dragon,” he says. “You are\nthe first who dared come so close!”\n“Ah ha!” says Michelle. ‘‘Wait until the Prince\nof Lyon learns your secret!”\n“Please, please.” The old man holds out his\narms to you. “I am an escaped serf. If they find\nme, they will hang me.”\nGo ont o page 84.\nSoa\n\nSBS ONS\nSe\need\nIh\nA\nzeye\nll\n\n84 :\n“We will keep your secret,” ” you say, ‘Sf you |\nwill just guide us on our way.” a\n“And where are you going?” he asks. ;\n“We are searching for the Forbidden Castle.”\nThe old man looks wistfully upward for a-\n“moment. ‘‘...That which falls but does not\nmove...” he says, smiling.\n“That’s part of the riddle!”\n“Will you keep my secret if I tell you the\nanswer?”\n“Yes!”\n“Then follow me.” .\nThe old man leads you further along the steep\nwinding trail, up over a high ridge. From the crest\nthe land drops down into a steep gully, and then\nrises up to become a magnificent snow-capped\npeak.\nHe holds a finger to his lips. ‘“Listen.”” You\nstand there, straining your ears. Across the ravine -\nyou can barely hear the faintest rushing sound, as\nfaint as a memory. .\n“A waterfall!” Michelle exclaims.\nThe old man smiles. ‘That which falls stays\nwhere it is!”’ !\nYou thank the old man and wish him well, and\nyou and Michelle hurry on along the trail with\nrenewed energy and high spirits.\nTurn to page9 1. ;\n\nn’t Avant our bones. boingi n thatp ile,” you\nall Michelle. ‘‘Let’s head back the way we\nmei\nMichelle wastes no time hurrying back down\n1e trail, and you are right behind her.\nFor a long time neither of you speaks. It looks\nif you have given up your best chance to reach\nthe Forbidden Castle. Sad, you descend the nar-\nTOW, winding trail leading back toward the farm.\n_ The afternoon sun has grown hot when\nMichelle points out a lake not far off your trail.\n“Let us go there to rest and get water,”’ she says.\nYou cut through the woods to the lake, and\ngratefully sit on a rock and dangle your feet in the\ncool, clear water.\n_ Then you both notice the same thing—a plume\no smoke rising from the opposite shore.\n“That looks like a campfire,’ you say. “Let’s\na who’s there. They might be able to guide us\n‘to a trail to the southern mountains.”\nTurn to page 94.\n\nSir Gregory gives you a box trap and some\ncheese. You have no trouble catching a couple of\nmice in the barn, and the next morning you and\nMichelle set out on your journey. Following Sir\nGregory’s directions, you head for the dragon\ntrail. But there are many forks and branches\n_ along the way, and by mid-afternoon you are\ntotally lost. All you can do is to continue on,\nhoping to find food and shelter. Finally, cold,\nhungry, and exhausted, you and Michelle lie\ndown to rest.\nTurn to page 96.\n‘",
    "choices": [
      {
        "text": "” If you decide to follow Sir Gregory’s advice",
        "destination": 86
      },
      {
        "text": "If you run to the tree and climb it, ©",
        "destination": 88
      },
      {
        "text": "— If you tell Michelle to follow you, and run for _ the stream",
        "destination": 89
      },
      {
        "text": "’ If you head west",
        "destination": 71
      },
      {
        "text": "haul you head east",
        "destination": 73
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 87,
    "text": "- You ask Sir Bertram his opinion of Sir Greg-\nry’s advice.\nHe laughs. ‘‘Nonsense! Just because all\nelephants are afraid of mice doesn’t mean all\n_large animals are afraid of mice. But if you blow\nona goat’s horn, the dragon will leave you alone.\nIt must be so, because the Duke of Foussy once\nsaw a dragon outside his castle. He leaned out\nthe window and blew on a goat’s horn. Soon\nafterward the dragon went away!”\nIf you decide to follow Sir Bertram’s advice,\nturn to page 97.\nIf you decide to ask one of the other\nPhilosophers, turn to page 99.\n\n688\nYou climb up the tree, right behindM ichelle. In”\nan instant the wolves are below you. They leap—\nup against the tree trunk. You and Michelle are —\ntrapped. There is nothing to do but wait.\nHours later, when darkness begins to fall, the —\nwolves are still there. Some of them are napping.\nOne of them quietly licks his paws. Another howls\nmournfully, while a third wolf sits motionless,\nstaring up at you.\nYou huddle against the cold through the long,\ndark night. The early morning light reveals no\nsign of the wolves, and you are eager to be down\nfrom the tree and on your way.\n“Shall we continue,” asks Michelle, ‘‘or wait a\ncouple of hours to make sure they are gone?”’\nIf you say, “Let’s go now,’’ turn to page 100,\nIf you say, “‘Let’s wait a while,”\nturn to page oe-",
    "choices": [
      {
        "text": "” If you decide to follow Sir Bertram’s advice",
        "destination": 97
      },
      {
        "text": "If you decide to ask one of the other Philosophers",
        "destination": 99
      },
      {
        "text": "”’ If you say, “Let’s go now,’’",
        "destination": 100
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 89,
    "text": "You and Michelle quickly reach the stream.\nthe water is cold, but you wade easily down-\n‘stream, for the water hardly rises above your\nknees. Finally, you feel you’ve come far enough\nto lose the wolves.\n__ After picking your way over round, slippery\nrocks, you emerge on the other side of the\nstream. Through the woods you can see a freshly\nploughed field. You hurry toward it.\nYou have no sooner reached the field when\nyou hear the pounding of hoof beats. A moment\nlater three horsemen come over ar ise, riding\nstraight for you. Two of them look like common\nknights, but the third has a dome-shaped helmet\ntopped by a sharp-pointed spike. His face is cov-\nered bya full, black beard, so that all you can see\nof him are his steel-gray eyes.\n__ “Who are you to set foot on the lands of Count\n: Gaston?” he demands.\n_ You start to explain, but he interrupts. “Have\nyou not heard of me?”\n_ You nod your head.\n“Then know that I fear no one. Now, what is\nyour purpose here?”’\n_ ‘We are looking for the Forbidden Castle,”\nMichelle says.\nGo on to page 90.",
    "choices": [
      {
        "text": "Michelle says. Go on to page 90",
        "destination": 90
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 90,
    "text": "The count latighe “You are neither wise\nenough nor strong enough to reach the Forbid-\nden Castle, for it is high in the mountains to the\nsouth. You may pass safely through my lands on\nyour journey, or, if you like, I shall permit you to\nremain here in my service. You will live well, and\nyou will learn more than you could by journeying\nall over Europe. If you stay, know that it shall be\nfor not one day less than a year! And at the end of\nthat year, if you wish, I, myself, will guide you to\nthe Forbidden Castle!”\n“Can you just tell us how to get there?’ you\nask.\n“IT have said what I intended to say,” the count\nreplies. “You must make your decision now!’\nIf you continue on through the lands of Count\nGaston, turn to page 103.\nify ou agree to remain in the count’s service,\nturn to page 1",
    "choices": [
      {
        "text": "’ If you continue on through the lands of Count Gaston",
        "destination": 103
      },
      {
        "text": "ify ou agree to remain in the count’s service",
        "destination": 1
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 92,
    "text": "iii = = eae\nafim=- wea)\nms te\nCapa SIN Goel)\nGIs Sige\neae Gx\n\\ “¥ Y j\now y\nMGZ - / Phe a WANdo YnOY 0 ae EeFeY w v, YI1N GGS MUHa OAL E\nWW ELE MLE DOLL\n“Do you think he can conquer the Forbidden\nCastle?”’ she asks.\nYou and Michelle run still higher, toward the\ncastle. Strange to see, the drawbridge lies open.\nThere aren’t even chains or ropes by which it\ncould be raised. A tiny woman wearing a long\ngray habit comes forth to greet you.\n‘Welcome! I am Sister Anna.”\n“Good day, Sister,”’ you say. “Where is the\nprince who rules this great castle?”\n“And why is it called the Forbidden Castle?”\nMichelle adds.\nSister Anna smiles. ‘There is no prince, nor\nknights here—only the Sisters of Hope. You see,\nonce a great prince ruled this castle, attended by\na splendid court, but a plague swept across the\nlands and wiped out all the lords and ladies who\nlived here—every one! For years no one dared to\ncome near, and so it became known as the For-\nbidden Castle.\n“But we vowed not to be afraid of plagues,\nwhether borne by rats, or kings, or knaves. We\na\nee\n\n£4\nL iy A ) L e i y Bi a sty W o Y y G Wa EIOK LAOE RI f K W D 2 G 04 Y) Bo y\ncame to tend the sick and helpless. Since then,\ngood fortune has come to all who have visited\n‘here in friendship.”\nAs Sister Anna is speaking, the third line of the\nriddle comes to your mind—“You’ll find what\nisn’t what it is.”’\n_ “Ts this a castle, or isn’t it?’ you ask.\n_ The sister smiles. ““You need only look at it to\nsee that it is a castle,” she says. ‘‘And yet it is not\n_a castle, with a lord and his vassals, but a refuge\nfor the poor and the helpless. Therefore, it isn’t\nwhat it is!’’\n_ You have been so amazed by the sister’s story\n_ that you have forgotten about King Henry and his\narmy. But now you hear bugles blowing, shouts,\n_and the sound of horses!\n_ Other sisters come forth from the castle. You\nand Michelle step aside as they form a line to\nblock pe oy and his Pave army.\nTurn to page 114.\n\nAs you reach the other side of the lake, Mi-\nchelle stops short. ‘Listen! Do you hear the\nmusic?” ?\nYou cut through the woods and slowly creep to\nthe edge of a clearing. Before you are three\nbrightly painted wagons. It is a gypsy camp!\nHorses, dogs, goats, and chickens are scattered\nabout. A dozen or so people are sitting around a\nfire. One man shakes a tambourine; another\nstrums a lute. Children are darting in and out, and\na woman is dishing up steaming stew from a huge\niron kettle.\nNear you, a dark-haired boy, a little older than\nyou, is soothing a colt, ‘Whoa, Lightning. What\nfrightens you?”’ The colt stares in your direction,\nand the boy shouts to the others. In a moment\nthe gypsies surround you, all of them talking at\nonce, ‘Who are you?” “Where did you come\nfrom?” “Where are you going?”’\n“We are looking for the Forbidden Castle,”\nsays Michelle. The gypsies laugh. |\n“If it is forbidden,”’ says the boy, “‘then it can-\nnot be a good thing to find. Why not forget it?\nJoin our band, instead!”\n“Yes! Yes!’ shout the others.\n“But the castle .. .,”» you begin.\nThe gypsy boy takes your wrist and stares at\nyour open palm. “You have already faced great\ndanger. If you continue, far greater danger awaits\nyou.”’ He drops your hand and grins. “If you stay\nwith us, you can ride horses, and swim streams,\nand have more fun than you would have in any\ncastle.”",
    "choices": [
      {
        "text": "block pe oy and his Pave army",
        "destination": 114
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 95,
    "text": "Michelle, who has already put on a crimson scarf.\n“Let us stay here a while,”’ she says.\n_ “All right,” you say. ‘I’ve always wondered\n_ what it’s like to be a gypsy.”\n_ Anolder man places the lute in your hand. You\npluck the strings, and listen to its rich tones.\n“You shall learn to play,” says Michelle, “‘and I\nshall learn to dance!’’ She joins the circle of peo-\nple whirling round the fire to the beat of the\ntambourine. You begin to pick out a tune on the\nlute. With each note, the twentieth century drifts\n- farther away.\nThe End\n\nae\nYou wake up, to find yourself lying in a crude >\nbed in a tiny room with walls of straw and clay.\nMichelle is nearby—still sound asleep. A woman\nis standing over you. She is dressed in simple\npeasant clothes. You manage to sit up, though\nyou still feel weak and dizzy. She props a pillow\nbehind you. “Here, drink this. The English\nknights are searching for you, but I told them that\nI had not seen anyone who looked like you or\nyour friend. Where, may I ask, were you\nbound?”\n“We were searching for the Forbidden Castle,”\nyou say.\n“Tl have heard of the Forbidden Castle,”’ says\nthe woman, “but I have also heard that it only —\nexists in dreams. So you might as well get some\nmore sleep—-perhaps you will find it in your\ndreams!”’\nYou lie back, and quite soon you fall asleep.\nAnd you dream of an ivory castle set on a moun-\ntain ledge near a waterfall. Its tall, rounded towers\ngleam in the pink-gold light of the setting sun. _\nSlowly, you awaken from the dream. You\nopen your eyes. The castle is gone, and so is\nMichelle and the kindly peasant woman, for, as\nyou can see by looking around, you are right\nhere, back in your own time.\nThe End\n\n3 97\nSir Bertram supplies you and Michelle with a\n5sh orn, shows you how to blow on it prop-\ny, and tells you how to find the trail to the\ngon. The next day you set out at dawn, hop-\n“ing that the trail will lead you safely past the\njragon and on to the castle.\n~ You travel on and on, but the trail seems to\nlead nowhere. You have almost given up hope\n_when you see three knights riding toward you.\nThey rein in their horses.\n“You are on the prince’s royal hunting\nground!” says the leader. “You will come with\nays!”\nThey lead you to a great stone house, set on\ntop of a hill, and down al ong stone stairway\neading to a room below the courtyard. They\npush you inside and lock the door behind you.\n_I tis pitch dark. You grope around, but you find\nno other place to sleep that night than the cold\ntone floor. Lying there in the dark you hear rats\nscurrying about. One of them nibbles at your ear.\n_ Life never looked so bad.\nThe End",
    "choices": [],
    "node_type": "ending_neutral"
  },
  {
    "section_number": 99,
    "text": "and Michelle knock at the chamber of a\nhird Philosopher, Sir René, and find him playing\nhess with Sir Charles. They listen impatiently\nile you ask their opinion of Sir Bertram’s\nidvice.\n_ “How foolish an argument,” says Sir René.\n§ “Just because the dragon ran away after the duke\nblew on his horn does not mean he ran because\nthe duke blew on his hor. You should ask the\n_s table-keeper, who must know about dragons as\nwell as horses.”\n_ “Nonsense!”’ cries Sir Charles. “The stable-\nkeeper is a peasant, and so would never know\nthe answer. They should journey to the court and\nsk Count de Rue. He is a man so worthy that he\n;o ften seen in the company of the prince!”’\n= “Ah yes, a much better idea. Ask Count de\ntue,”’ says Sir René. He moves his rook across\n_the chess board. “Check!”\nYou take Michelle aside. ‘‘I think they’re all\nrazy,” you whisper. ‘What do you think?”\n“Perhaps,” says Michelle, “but they do not\nseem unkind. One of them may even help us find\nthe Forbidden Castle. If only we knew which one\nto believe...”\nz If you decide to journey to the court to see\nCount de Rue, turn to page 105.\nyou decide to dalle to yet another Philosopher,\n. turn to page 107.",
    "choices": [
      {
        "text": "” z If you decide to journey to the court to see Count de Rue",
        "destination": 105
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 100,
    "text": "You climb down the tree, moving as silently as\nyou can. Michelle follows. You stand there a\nwhile, ready to climb back up at any second.\n‘Tet’ s go,’”’ you whisper. |\nYou have almost reached the shallow stream at\nthe edge of the forest when you hear once again\nthe mournful howling of the wolves.\nMichelle starts to run toward the stream. You.\nfollow close behind. But now you see them—at\nleast a dozen gray wolves, running along on\neither side of you, closing in. This time there are\nno trees to climb. You grab a stick to use as a\nweapon, but there are too many. of them, and\nthey are hungry..\nThe End",
    "choices": [],
    "node_type": "ending_neutral"
  },
  {
    "section_number": 101,
    "text": "ter waiting a few hours without seeing or\nnearing any wolves, you climb down the tree.\nchelle follows closely behind. Keeping a sharp\ntch, you make your way across the stream and\ncross a meadow. You climba s teep hill. From the\ntop you can see the mountains beyond. One of\nthem is higher than the others. Patches of snow\nee:i n the gullies near its peak.\n“We haven't solved the riddle,”’ you say, ““but\n-t here’ s a chance that from the top of that moun-\n_t ain we will be able to see the Forbidden Castle.”’\n___ Late the next day, as you and Michelle wearily\n-c limb the steep slope of the mountain, you begin\nto realize that the distance to the top is much\n\" greater than it looked. You doubt whether you\ncan reach the summit. To make matters worse,\nthe higher you climb, the colder it gets. The\nclouds grow thicker, and the wind blows harder,\nbringing with it fog and rain that ruin your hopes\nof glimpsing the Forbidden Castle.\nTurn to page 108.\n\ny {<*_> ».\nOe\n2}\nPy\nah:",
    "choices": [
      {
        "text": "of glimpsing the Forbidden Castle",
        "destination": 108
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 103,
    "text": "‘Thank you for your offer,” you tell the count.\n“We would rather have our freedom.”\nThe count leaps down from his horse, grabs\n_ you by your hair, and swings you around. Then\n__ he pushes you roughly away, and looks into your\npack. 7\n_ “T see that you have very little food left.\nBeyond my lands are woods thick with robbers\nd wolves. You are brave, but you are foolish!”\nYou start to speak, but the count is already\nremounting his horse. “‘Adieu,’’ he cries as he\ntides briskly away.\nOne of the knights returns your pack. The\nother prods you with his lance. “Get moving.”\n“He could have given usa l ittle more time to\nink,” says Michelle.\n~ “Count Gaston never asks twice,’ , says the\nknight. “Follow me.”\nTurn to page 109.\n©",
    "choices": [
      {
        "text": "knight. “Follow me.”",
        "destination": 109
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 104,
    "text": "Fearing that you could never make it to the ©\nForbidden Castle on your own, you and Michelle ©\nagree to stay in the service of the count.\nYou soon learn what it is like to be in the\nservice of Count Gaston. As a page, you must\nalways be ready to assist your lord. Each day you -\nmust prepare his clothing, care for his armor, and |\nwait on his table. You even learn to hunt with\nfalcons. Michelle is in training to be a lady of the\ncourt. Her time is devoted to music, poetry, and\nLatin, as well as riding. At the end of the day,\n‘there is chess and backgammon for you, and\nastronomy for Michelle. Then bed. Every day is\nthe same. There is plenty of food, and your mas-\nter is not unkind, but your heart aches—you long\nto be free.\nOne day, about a month later, the count visits\nyou. ‘‘What’s the matter with you two?” he says.\n“You eat well, and you are sheltered from the —\ncold winds and rain. You have warm clothes.”\nThe count grows angry as he talks. ‘“You are\nungrateful for all that | have done for you. Would ©\nyou rather I had left you to the wolves?”\nYou bow your head. There is little you can say.\nThe count strides off. You return to your cell and\ncarve another tiny mark in a comer of the thick\noak floor. Only 327 days until you and Michelle ©\nare free again.\nThe End\n\nCharles gives you directions icant the ©\nthe palace of the Count de Rue. Early —\nnext morning, you pack as much food and\nplies as you can carry, and set out on your\nmey.\n_ For four days you and Michelle follow first one | |\ntrail and then another, through woods so dense ~\nthat you almost never see the sun. Sir Charles'ss\ndirections seem to make no sense.\nAt last you admit to each other that you are\nlost. You wander on and on, hoping to find your\nay, but the trails you have followed are -\npassageways in an endless maze.\n_ You and Michelle are never seen again.\nThe End\n\n\n\nock on the door of Sir Harold, another\nPhilosopher.\n_ “Come in, come in, come in,” he eile\nWhen you tell SirH arold what Sir Charles and\nSir René advised you, he shakes his head.\n“No, no, no, no, no. . . They’re wrong, for the\n_ truth of what a man says does not depend on\n_ who he is or who his friends are. Let me tell you\n_ what to do: the dragon can be captured by hold-\n_ ing a noose outside his cave, because when the —\n3 dragon comes out he will walk right into the\n- noose.’\n_ “Are you sure that will work?” you ask.\nSir Harold strokes his beard a few times, as if\ndeep in thought, and says, “Yes, yes, yes... _\nabsolutely, because it is logical and self-evident.\n_ Moreover, it stands to reason, and, finally, it is\nindisputable!”\nIf you decide that Sir Harold’s advice is prob-\nably as good as any, and you might as well\nfollow it, turn to page 110.\n‘you decide oe Sir Harold’s advice is ad\nturn to page 112.",
    "choices": [
      {
        "text": "” If you decide that Sir Harold’s advice is prob- ably as good as any, and you might as well follow it",
        "destination": 110
      },
      {
        "text": "‘you decide oe Sir Harold’s advice is ad",
        "destination": 112
      }
    ],
    "node_type": "normal"
  },
  {
    "section_number": 108,
    "text": "Finally, you and Michelle can climb no farther.\nYou stop—cold, weak, wet, hungry, and ex- 9\nhausted.\nSuddenly you hear a deep, loud barking.\n‘What is that?” cries Michelle.\n‘More wolves! Come on! We’ve got to find\nshelter!’’ But even as you are talking, you see two\nenormous white wolves running toward you. This\ntime, there’s no chance you'll escape.\n‘‘They’re dogs!”’ shouts Michelle.\nAnd they are—Great Pyrenees mountain dogs!\nOne of them licks Michelle’s face—she laughs.\nThe other tugs at your sleeve. You both laugh..\n‘Michelle, I think they want us to follow them!”’\nFilled with new energy, you follow the great\nwhite dogs over the top of the ridge. Night will\nsoon be upon you, but the sky grows brighter in\nthe west as the storm clouds break. By the time\nyou reach the top of the ridge, the mists have\nlifted, and the red sun—just about to set—breaks\nthrough the clouds.\nThere, before you, gleaming in the last pink\nlight of the day, is a white stone castle capped by —\nfour ivory towers.\nYou blink and look again. ‘Michelle, it’s the\nForbidden Castle!’’\nMichelle gives you a hug. ‘“‘What a beautiful\nsight,” she says. ‘“‘No matter what happens now, I\nwill feel that it was worth the trip!”’\n“I agree,” you say.\nThe End",
    "choices": [],
    "node_type": "ending_win"
  },
  {
    "section_number": 109,
    "text": "G on s night escorts you to the edge of the\nforest. You and Michelle travel on through the\nwoods, hoping to find food and shelter. Fortu-\nnately, you encounter neither wolves nor rob-\n_ bers, but the weather changes. A chill wind blows\nfrom the north, and great dark clouds fill the sky.\nSuddenly Michelle grabs your arm. “Look—a_\ncave! Shall we take ee. before the storm\nhits?”\nIf you continue on, turn to page 113.\nIfy ou go into the cave, turn to page 50.\n\n10...\nSir Harold gives you and Michelle a sharp knife\nand a strong, heavy rope, and you set out for the ©\ndragon trail. i\nYou are happy when, by late afternoon, you ~\ncome upon a little thatched cottage. Hoping to —\nfind a place to stay for the night, you knock on\nthe door. It is opened by a slender woman with\nlong blond hair. A sparkling green stone hangs —\nfrom a chain around her neck. You can’t stop\nlooking into her glittering eyes.\n“You have traveled far,”’ she says. ‘“Come with -\nme and rest. Is hall bring you hot broth.”’\nYou and Michelle follow her inside. As you\nstart to warm your hands by the fire, the woman\nbolts the door. Then, turning toward you, she ©\nsmiles; it is a strange smile. ‘Poor things—you do ©\nnot seem to be able to tell a witch when you see\none. Now you will learn quite well as you receive —\nmy spell.” :\n“What spell?”\n“A spell of forgetfulness, so that you will not\nremember how you returned to your own\ntimes)” ‘\nThe End\nDo you remember?\n\nry",
    "choices": [
      {
        "text": "” If you continue on",
        "destination": 113
      }
    ],
    "node_type": "normal"
  }
]